# Code:

In [1]:
# import packages
from sqlalchemy import create_engine
import pandas as pd

In [2]:
# create engine
engine = create_engine('mysql+pymysql://root:password@localhost/country_club')

In [3]:
# run the SQL queries for each question in the mini project. The result of each 
# query is stored in the dataframe qx where x is the question number in the project
with engine.connect() as con:
    
    rs = con.execute("SELECT DISTINCT name FROM facilities WHERE membercost > 0")
    q1 = pd.DataFrame(rs.fetchall())
    q1.columns = rs.keys()
    
    
    rs = con.execute("SELECT COUNT(DISTINCT name) FROM facilities WHERE membercost = 0")
    q2 = pd.DataFrame(rs.fetchall())
    q2.columns = rs.keys()

    rs = con.execute("SELECT facid, name, membercost, monthlymaintenance "
                     "FROM Facilities "
                     "WHERE membercost < (0.2*monthlymaintenance)")
    q3 = pd.DataFrame(rs.fetchall())
    q3.columns = rs.keys()
    
    rs = con.execute("SELECT * FROM facilities WHERE facid IN ('1','5')")
    q4 = pd.DataFrame(rs.fetchall())
    q4.columns = rs.keys()
    
    rs = con.execute("SELECT name," 
                             "monthlymaintenance,"
                             "CASE WHEN monthlymaintenance < 100 THEN 'cheap' "
                             "ELSE 'expensive' END AS affordability "
                     "FROM facilities")
    q5 = pd.DataFrame(rs.fetchall())
    q5.columns = rs.keys()
    
    rs = con.execute("SELECT firstname, surname "
                     "FROM bookings "
                     "JOIN members "
                     "ON bookings.memid = members.memid "
                     "WHERE starttime = (SELECT MAX(starttime) FROM bookings) AND "
                    "bookings.memid != '0'")
    q6 = pd.DataFrame(rs.fetchall())
    q6.columns = rs.keys()
    
    rs = con.execute("SELECT DISTINCT facilities.name, "
                                      "CONCAT(members.firstname,' ',members.surname) AS member_name "      
                     "FROM bookings "
                     "JOIN facilities "
                     "ON bookings.facid = facilities.facid "
                     "JOIN members "
                     "ON bookings.memid = members.memid "
                     "WHERE facilities.name LIKE '%%Tennis Court%%' "
                     "ORDER BY member_name")
    q7 = pd.DataFrame(rs.fetchall())
    q7.columns = rs.keys()
    
    rs = con.execute("SELECT name, "
                             "CONCAT(firstname,' ',surname) AS member_name, "
                             "CASE WHEN bookings.memid = 0 THEN guestcost * slots "
                             "ELSE membercost * slots END AS cost " 
                     "FROM bookings "
                     "JOIN facilities "
                     "ON Bookings.facid = facilities.facid "
                     "JOIN members "
                     "ON bookings.memid = members.memid "
                     "WHERE starttime LIKE '%%2012-09-14%%'AND "
                            "((guestcost * slots > 30 AND bookings.memid = 0) OR "
                             "(membercost * slots > 30 AND bookings.memid != 0)) "
                     "ORDER BY cost DESC")
    q8 = pd.DataFrame(rs.fetchall())
    q8.columns = rs.keys()

    rs = con.execute("SELECT name, "
                             "CONCAT(firstname,' ',surname) AS member_name, "
                             "CASE WHEN memid = 0 THEN guestcost * slots "
                             "ELSE membercost * slots END AS cost " 
                     "FROM (SELECT bookings.memid AS memid, "
                                  "bookings.facid, "
                                  "firstname, "
                                  "surname, "
                                  "slots, "
                                  "membercost, "
                                  "guestcost, "
                                  "starttime, "
                                  "name "
                            "FROM bookings "
                            "JOIN facilities "
                            "ON bookings.facid = facilities.facid "
                            "JOIN members "
                            "ON bookings.memid = members.memid) AS T "
                     "WHERE starttime LIKE '%%2012-09-14%%'AND "
                           "((guestcost * slots > 30 AND memid = 0) OR (membercost * slots > 30 AND memid != 0)) "
                     "ORDER BY cost DESC")
    q9 = pd.DataFrame(rs.fetchall())
    q9.columns = rs.keys()

    rs = con.execute("SELECT name, "
                             "SUM(fee * slots) AS revenue "
                     "FROM (SELECT CASE WHEN bookings.memid = 0 THEN guestcost "
                                   "ELSE membercost END AS fee, "
                                   "slots, "
                                   "name "
                     "FROM bookings "
                     "JOIN facilities "
                     "ON bookings.facid = facilities.facid) AS booking_Fees "
                     "GROUP BY name "
                     "HAVING revenue < 1000 "
                     "ORDER BY revenue")
    q10 = pd.DataFrame(rs.fetchall())
    q10.columns = rs.keys()

# Results :

In [4]:
q1

             name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

In [5]:
q2

   COUNT(DISTINCT name)
0                     4

In [6]:
q3

   facid             name membercost  monthlymaintenance
0      0   Tennis Court 1        5.0                 200
1      1   Tennis Court 2        5.0                 200
2      2  Badminton Court        0.0                  50
3      3     Table Tennis        0.0                  10
4      4   Massage Room 1        9.9                3000
5      5   Massage Room 2        9.9                3000
6      6     Squash Court        3.5                  80
7      7    Snooker Table        0.0                  15
8      8       Pool Table        0.0                  15

In [7]:
q4

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000,200
1,5,Massage Room 2,9.9,80.0,4000,3000

In [8]:
q5

              name  monthlymaintenance affordability
0   Tennis Court 1                 200     expensive
1   Tennis Court 2                 200     expensive
2  Badminton Court                  50         cheap
3     Table Tennis                  10         cheap
4   Massage Room 1                3000     expensive
5   Massage Room 2                3000     expensive
6     Squash Court                  80         cheap
7    Snooker Table                  15         cheap
8       Pool Table                  15         cheap

In [9]:
q6

  firstname            surname
0     Henry  Worthington-Smyth

In [10]:
q7

              name        member_name
0   Tennis Court 1         Anne Baker
1   Tennis Court 2         Anne Baker
2   Tennis Court 2       Burton Tracy
3   Tennis Court 1       Burton Tracy
4   Tennis Court 1       Charles Owen
5   Tennis Court 2       Charles Owen
6   Tennis Court 2       Darren Smith
7   Tennis Court 2      David Farrell
8   Tennis Court 1      David Farrell
9   Tennis Court 2        David Jones
10  Tennis Court 1        David Jones
11  Tennis Court 1       David Pinker
12  Tennis Court 1      Douglas Jones
13  Tennis Court 1      Erica Crumpet
14  Tennis Court 2     Florence Bader
15  Tennis Court 1     Florence Bader
16  Tennis Court 2     Gerald Butters
17  Tennis Court 1     Gerald Butters
18  Tennis Court 2        GUEST GUEST
19  Tennis Court 1        GUEST GUEST
20  Tennis Court 2   Henrietta Rumney
21  Tennis Court 2         Jack Smith
22  Tennis Court 1         Jack Smith
23  Tennis Court 1    Janice Joplette
24  Tennis Court 2    Janice Joplette
25  Tennis Court 1     Jemima Farrell
26  Tennis Court 2     Jemima Farrell
27  Tennis Court 1        Joan Coplin
28  Tennis Court 1          John Hunt
29  Tennis Court 2          John Hunt
30  Tennis Court 1    Matthew Genting
31  Tennis Court 2  Millicent Purview
32  Tennis Court 2         Nancy Dare
33  Tennis Court 1         Nancy Dare
34  Tennis Court 2    Ponder Stibbons
35  Tennis Court 1    Ponder Stibbons
36  Tennis Court 1   Ramnaresh Sarwin
37  Tennis Court 2   Ramnaresh Sarwin
38  Tennis Court 2         Tim Boothe
39  Tennis Court 1         Tim Boothe
40  Tennis Court 2         Tim Rownam
41  Tennis Court 1         Tim Rownam
42  Tennis Court 2      Timothy Baker
43  Tennis Court 1      Timothy Baker
44  Tennis Court 2        Tracy Smith
45  Tennis Court 1        Tracy Smith

In [11]:
q8

              name     member_name   cost
0   Massage Room 2     GUEST GUEST  320.0
1   Massage Room 1     GUEST GUEST  160.0
2   Massage Room 1     GUEST GUEST  160.0
3   Massage Room 1     GUEST GUEST  160.0
4   Tennis Court 2     GUEST GUEST  150.0
5   Tennis Court 1     GUEST GUEST   75.0
6   Tennis Court 1     GUEST GUEST   75.0
7   Tennis Court 2     GUEST GUEST   75.0
8     Squash Court     GUEST GUEST   70.0
9   Massage Room 1  Jemima Farrell   39.6
10    Squash Court     GUEST GUEST   35.0
11    Squash Court     GUEST GUEST   35.0

In [12]:
q9

              name     member_name   cost
0   Massage Room 2     GUEST GUEST  320.0
1   Massage Room 1     GUEST GUEST  160.0
2   Massage Room 1     GUEST GUEST  160.0
3   Massage Room 1     GUEST GUEST  160.0
4   Tennis Court 2     GUEST GUEST  150.0
5   Tennis Court 1     GUEST GUEST   75.0
6   Tennis Court 1     GUEST GUEST   75.0
7   Tennis Court 2     GUEST GUEST   75.0
8     Squash Court     GUEST GUEST   70.0
9   Massage Room 1  Jemima Farrell   39.6
10    Squash Court     GUEST GUEST   35.0
11    Squash Court     GUEST GUEST   35.0

In [13]:
q10

            name revenue
0   Table Tennis   180.0
1  Snooker Table   240.0
2     Pool Table   270.0